let dumkyHash = {
  '': [
    `Що для тебе є найважливіше? \n  Немає нічого важливішого, ніж жити з Богом тут, на\
      землі, і досягнути вічности з Ним`,
    `Коли не знаєш, як молитися, — просто дякуй: \n\
       Господи, дякую Тобі за те, що Ти зі мною \n  Господи, дякую Тобі за те, що я з\
      тобою`,
    `Дякуйте не тільки за те, що вам дається, але й за те, що відбирається \n "Там" краще\
      знають, що і скільки вам потрібно`,
    'Господи, Ісусе Христе, Сину Божий, помилуй мене, грішного',
    `Отче Наш, що єси на небесах, \n  Нехай святиться Імʼя Твоє; \n\
       Нехай прийде Царство Твоє; \n\
       Нехай буде воля Твоя, як на небі, так і на землі. \n\
        Хліб наш насущний дай нам сьогодні; \n\
        І прости нам провини наші, як і ми прощаємо винуватцям нашим; \n\
        І не введи нас у спокусу; \n   Але визволи нас від лукавого. \n\
      Бо Твоє є Царство, і сила, і слава, Отця, і Сина, і Святого Духа, нині, і повсякчас,\
      і на віки віків. Амінь.`,
    `Ангеле Божий, Хоронителю мій святий, Богом з неба даний мені на охорону, щиро благаю\
      Тебе: просвічуй мене сьогодні, хорони від усього злого, заохочуй до добрих справ, і\
      провадь на спасенну дорогу. Амінь.`,
    'Мій Боже, дякую Тобі за те, що Ти даєш, за те, що віднімаєш. Нехай станеться воля Твоя!',
    `Господи, я прошу не про чудеса і не про міражі, а про силу кожного дня. Зроби мене\
      уважним і допитливим, щоб у строкатості буднів вчасно зупинятися на відкриттях і\
      досвіді, які мене схвилювали. Убережи мене від страху пропустити щось у житті. Дай\
      мені не те, чого я собі бажаю, а того, що мені направду необхідне. Навчи мене\
      мистецтву маленьких кроків.`,
    `Господи, дай мені зустріти з душевним спокоєм усе, що принесе мені цей день. Дай мені\
      цілковито віддатися на волю Твою святу. На всяк час дня цього в усьому настанови і\
      підтримай мене, Господи. Які б я не дістав звістки, навчи мене приймати їх зі спокійною\
      душею і твердим переконанням, що на все Свята Воля Твоя. У всіх ділах моїх і словах\
      керуй думками моїми і почуттями. У всіх непередбачених випадках не дай мені забути, що\
      все Ти посилаєш. Навчи мене просто і мудро ставитися до всіх людей, нікого не\
      ображаючи, ані засмучуючи. Господи, дай мені силу перенести втому і всі події цього\
      дня. Керуй моєю волею і навчи мене молитися, вірити, надіятися, терпіти, прощати і\
      любити. Амінь.`,
    `Іван Хреститель, наш спаситель,
      Охрести все кругом: о́кна, двері, по́зи, ще́лі.
      Благослови мене в дорогу, раба Божого (імʼя), в путь-посте́лю.
      Благослови, Боже, поможи, Боже. Амінь.`,
    `Нехай воскресне Бог і розвіються вороги Його, і нехай біжать від лиця Його всі\
      ненависники Його. Як щезає дим, нехай щезнуть, як тане віск від лиця вогню, так нехай\
      згинуть біси від лиця тих, хто любить Бога і хто осіняє себе хресним знаменням і в\
      радості промовляє: радуйся, Пречесни́й і Животворчий Хресте Господній, що проганяєш\
      бісів силою розпʼятого на Тобі Господа нашого Ісуса Христа, що до пекла зійшов, і\
      подолав силу диявола, і дарував нам Тебе, Хрест Свій Чесни́й, на прогнання всякого\
      супротивника. О Пречесни́й і Животворчий Хресте Господній, допомагай мені зі Святою\
      Дівою Богородицею й зо всіма святими Небесними Силами, завжди, нині, і повсякчас, і\
      на віки віків. Амінь.`,
    `Спати кладусь — Хрестом Хрещусь,
      Хрести мене, Господи, своєю рукою,
      Обвий мене своєю ризою святою,
      І стій мені в голові, і Ангели по боках,
      Зіроньки світять наді мною,
         А ти, Матінко Божа! Завжди будь зі мною,
         Прийди, Божа Мати, нічку ночувати,
         Від усього злого обороняти,
         Не погорди мною, Царице Небесна!
         А помилуй мене, грішника,
                      Амінь.`,
    `Наші серця́.
        В кінці життя принесемо Богу наші серця як життєвий здобуток. Молимо, щоб принести\
      його, серце, в якнайкращому стані: "хліб наш насущний дай нам сьогодні", щоб ми ще мали\
      змогу встигнути покращити своє серце. "Прости нам провини наші", щоб, якщо не встигнемо все\
      недобре вичистити зі свого серця або чогось не помітимо, щоб це не стало вирішальним\
      фактором на Суді. "Не введи нас у спокусу", щоб нові плями не зʼявлялися, і наша робота з\
      очищення не була марною. "Визволи нас від лукавого", бо якщо ми його і вичистимо (серце),\
      щоб він (лукавий) не мав над нашим серцем влади і не пожинав наше серце замість Ангелів,\
      тобто, щоб наше серце було напряму видно Богові і ніхто його не викривляв так, як схоче.\
      Яка ж-бо користь з серця, якщо воно не підзвітне Богові і все добре в ньому приховується\
      лукавим?
        Перша частина цієї молитви — шана святому, друга — прохання наших потреб, зокрема,\
      принести плід свого життя — серце — в якнайкращому стані, бо за плодом судиться дерево.\
      І буде прийняте рішення — рубати його, чи ні.`,
    `Винагорода.
        Що є винагородою в житті? Втіха. Добрі люди втішаються добрими справами, а злі —\
      злоробством. Але яка втіха від зла? Адже якими би люди не були злими, али чи хтось дасть\
      своєму синові камінь, коли той попросить хліба?
        Тож, не треба жалкувати за несправедливою оплатою і перетворювати, розмінювати своє\
      життя — найцінніший дар — на обурення, бо найкращою оплатою у світі є втіха від зробленої\
      доброї справи.`,
    `Тіло, душа і дух — це те, з чого складається людина. Про тіло ми печемося на роботі 8 годин,\
      про душу після роботи 4 години, а про дух щонеділі 2 години. І називаємо щастям те, коли\
      робота нам випала "до душі", бо тоді душа не голодує, як зазвичай. Невтамованим залишається\
      тільки дух.`,
    `Піст допомагає людині очистити себе від зла — від гріховних схильностей, допомагає більше\
      пам'ятати про Бога і бути ближче до Нього.`,
    `І видимий, і невидимий світ створені Богом. Між одним та іншим світом існує дивна єдність,\
      тобто спорідненість. Тому видимий світ говорить нам про закони невидимого, небесного\
      світу.\
      Все наше земне життя, з усім життям видимого світу, є велика притча Божа про закони\
      майбутнього життя в Царстві Небесному.`,
    `Свічка — як людське життя — згорає один раз за певний проміжок часу, за якого ділиться\
      своїм теплом з іншими, запалює інші свічки безкоштовно, без усякої вигоди.`,
    'Дивись ти, що скарби збираєш, на того, що через них повісився.',
    'Господь є просвічення моє і Спаситель мій, кого мені боятися?',
    'Що я віддам Господеві за все, що Він дав мені?',
    'Втікай від ненаситної душі, що на Учителя так наважилась.',
    `Дехто сказав: "релігія — це забобони, які треба викинути з голови і забути. Натомість\
      жити в доброті і зичити цю доброту іншим. І поститися в певні дні — теж забобон, треба\
      жити нормально щодня". І це внутрішнє добро — це і є Бог, а наші тіла — Його храм.`,
    'Щодня треба жити нормальне життя, не засмічувати ні своє тіло, ні душу.',
    `Щодня треба бути уважним, щоб не розсаджувати в своїй душі розсаду диявола —\
      людиноненависть.`,
    'Всесвіт навкруги тебе — всесвіт у тобі.',
    'Великий Бог наш і велика сила Його, а розумові Його немає кінця.',
    'Хто рано встає — тому Бог дає, а хто пізно ходить — той сам собі шкодить.',
    `Усе, що робиш — для себе.\
      Шкоду? Користь? Допомагаєш? — Собі.\
      Благословляєш? Повчаєш? Засуджуєш? — Себе.\
      Усміхаєшся? Прощаєш? Любиш? Ненавидиш? Засмучуєш? — Усе себе, собі і для себе.`,
    'Життя має бути благословенне.',
    `Передайте вашим посланцям, що в них дарунки погані, бо тільки-но дадуть, як тут же\
      віднімуть. Дарунки ж Божі — добрі, бо Бог як дає, то вже не віднімає.`,
    'Любов — найкоротший шлях до Царства Небесного.',
    'Блаженний той, хто не осуджує себе в тому, що вибирає. (Рим. 14)',
    `Матеріальні статки дістаються з великими зусиллями. А духовні хіба даром дадуться?\
      Особливо така велика і важлива річ, як спасіння.`,
    'Праведність нічого не дає людині, а святість наближає людину до Бога.',
    `Жалкувати не треба ні про що, бо на кожну мить свого життя ти користуєшся своїм набутим\
      знанням, і чиниш якнайкраще. А якщо чиниш якнайкраще і жалкуєш, то Бог тобі посилає гірше,\
      бо саме цього ти просиш, коли жалкуєш.`,
    'Доки живий — роби любов.',
    `Хто сіє скупо — той скупо і пожне. А хто сіє щедро —  той щедро і пожне. Кожен приділяй з\
      ласки серця, не з гіркотою і не з примусом, бо хто дає доброзичливо, того любить Бог.`,
    `Щоб зрозуміти, що після смерті відбудеться Преображення, Боженька дає нам підказку у\
      вигляді земного преображення: от ми, діти, потім раптом нас починають звати дядями і\
      тьотями, хоч ми цього не просили і не очікували. Не очікували, а маємо. Потім — бабусі і\
      дідусі. Ми би і раді противитися цьому, але не можемо. Хто-ж бо може противитися волі\
      Божій? А це його задум, щоб тіло змінювалося і старіло. Не наш. Але Він нас преображає.\
      Такий порядок.`,
    `Якщо кожному з нас випала своя карта і ми собою не керуєм, то можна жити спокійно і легко,\
      не обтяжуючись думками про майбутнє.\
      Як казала одна людина: "Мене не цікавить минуле, бо його я не можу змінити.\
      Мене не цікавить майбутнє, бо я не знаю, що в ньому. Мене цікавить сьогодення, бо саме в\
      ньому я можу щось змінити, щоб майбутнє було кращим".`,
    `Нас звідусіль тиснуть, але ми не стиснені; ми в безвихідних обставинах, але не втрачаємо\
      надії; нас гонять, але ми не покинуті; повалені, але не погублені. (2 Кор. 4:8-9)`,\
    `Люди потребують сектантства. Коли скажеш їм, що відмовився від м'яса, вони тут же почнуть\
      запитувати, чи їм я сметану і яйця, наче вони схожі на м'ясо. Коли скажеш їм про Пресвяту\
      Трійцю, тут же почнуть питати, чи є богоугодною та чи інша справа.`,
    'Слово на примирення плотоядних і плодоядних: (Рим. 14) (1 Тим. 4:8)',
    'Не бійся, мале стадо! Бо Отець ваш благозволив дати вам Царство. (Лк. 12:32)',
    'Вино — радість. Хліб — насичення.',
    `Коли вас як християнина називають фанатиком або іншим чином стримують у провадженні\
      богопізнання: (Лк. 13:18-29)`,
    `Вогняної спокуси, що посилається вам для випробування, не цурайтеся, ніби пригоди для вас\
      чужої, оскільки ви берете участь у стражданнях Христових, радійте, щоб і в з'явлення\
      слави Його ви зраділи і звеселились.`,
    '',
    '',
    '',
    '',
  ],
  'Григорій Сковорода': {
    'https://fb.watch/mWu5DR-Tc7/': [
      'Без ядра горіх ніщо, так само, як і людина без се́рця',
      'Більше думай, а тоді вирішуй. Спіши повільно!',
      `Для шляхетної людини ніщо не є таким важким, як пишний бенкет, особливо коли перші\
        місця на ньому займають пустомудрі`,
      'Добрий розум робить легки́м будь-який спосіб життя',
      'З видимого пізнавай невидиме',
      'Землеробство вдесятеро ліпше всіх кручених наук, тому що воно для всіх найпотрібніше',
      'Коли зерно добре, добрими насолоджуєшся плодами',
      'Краще голий та прави́й, ніж багатий та беззаконний',
      'Любов виникає з любови; коли хочу, щоб мене любили, я сам перший люблю',
      `Нам недобре від того, що ми знаємо багато зайвого, а не знаємо найпотрібнішого: сами́х\
        себе́`,
      'Насіння лихих справ — лихі думки',
      'Не все те отрута, що неприємне на смак',
      'Не той дурний, хто не знає, але той, хто знати не хоче',
      'Не тіло, а душа є людиною',
      'Подяка блаженному Богові за те, що потрібне зробив нетрудним, а трудне — непотрібним',
      'Світло бачиться тоді, коли світло в очах є',
      'Солодкий шлях життя, коли совість чиста',
      'Ти не можеш віднайти жодного друга, не нашукавши разом з тим і двох-трьох ворогів',
      'Треба скрізь дивитися подвійно: одне брати в душу, а друге — у розум',
      'У істини проста мова',
      'Хто швидко приліпляється до нової думки, той швидко від неї і відпадає',
      'Хіба може говорити про біле той, котрому невідоме, що таке чорне?',
      'Чисте небо не боїться блискавки та грому',
      'Що вподо́бав, на те й перетворився',
      'Що хочеш шукай, але не згуби миру',
      'Як ліки не завжди приємні, так і істина буває сувора',
      `Якщо любиш прибуток, шукай його пристойним шляхом. Тисяча на те перед тобою\
        благословенних реме́сел`,
      'Якщо прикрашаєш і вдягаєш тіло, не забувай і се́рця',
    ]
  }
};

/*
 *
 * returns {array}
 */
function extractArray(obj) {
  let arr = [];
  if (Array.isArray(obj)) {
    for (let elem of obj) {
      arr.push(elem);
    }
    return arr;
  }
  for (let key in obj) {
    let extractedArr = extractArray(obj[key]);
    for (let elem of extractedArr) {
      arr.push(elem);
    }
  }
  return arr;
}

/*
 * Attaches an array of sentences to a root element
 * @param {array}
 * @param {HTMLElement}
 * @returns {void}
 */
function fillRoot(arr, root) {
  root.innerText = '';
  for (let elem of arr) {
    let p = document.createElement('p');
    p.innerText = elem;
    root.appendChild(p);
  }
}

function load(elem, key) {
  for (let el of document.querySelectorAll('div.nav p')) {
    el.style.borderColor = 'transparent';
  }
  elem.style.borderColor = '#888';
  let root = document.getElementById('root');
  let status = document.createElement('p');
  status.innerText = 'Loading...';
  root.appendChild(status);

  let dumkyArray = extractArray(dumkyHash[key]);
  fillRoot(dumkyArray, root);

  status.innerText = '';
}

//Array.from(document.querySelectorAll('div.nav p')).at(-1).click();

(function(){
  const step = 20;
  const canvas = document.getElementById('canv');
  canvas.addEventListener('click', function(e) {
    e.target.style.display = 'none';
  });
  const ctx = canvas.getContext('2d');

  const w = canvas.width = document.body.offsetWidth;
  const h = canvas.height = document.body.offsetHeight;
  ctx.fillStyle = '#000';
  ctx.fillRect(0, 0, w, h);

  const cols = Math.floor(w / step) + 1;
  const ypos = Array(cols).fill(0);

  function doMatrix() {
    ctx.fillStyle = '#0001';
    ctx.fillRect(0, 0, w, h);

    ctx.fillStyle = '#0f0';
    ctx.font = '15pt mono';

    ypos.forEach((y, ind) => {
      const text = String.fromCharCode(Math.floor(Math.random() * 127));
      if (text === '_') return;
      if (/\W/.test(text)) return;

      const x = ind * step;
      ctx.fillText(text, x, y);

      if (y > Math.random() * 100 * step * 4) ypos[ind] = 0;
      else ypos[ind] = y + step;
    });
  }
//  setInterval(doMatrix, 50);
})();
